Repository: cohena100/Connection-
Catalog: Connection!/*.lproj/Localizable.strings
Languages: he

source: Can't accept invitation.
he: לא יכול לאשר הזמנה.

source: Can't add connection.
he: לא יכול להוסיף איש קשר.

source: Can't delete connection.
he: לא יכול למחוק איש קשר.

source: Got an incorrect response from the server.
he: תשובה שגוייה הגיע מהשרת.

source: Got an internal error.
he: שגיעת פנים אירעה.

source: Invite a contact from your address book by sms
he: הזמן איש קשר ע״י שליחת הודעה

source: Message Composing
he: עריכת הודעה

source: OK
he: אוקיי

source: Please accept my invitation by entering in Connection!: %@
he: אנא אשר את ההזמנה שלי ע״י הקשרת %@ באפליקציית קשר!

source: Please setup the Messages app and try again.
he: אנא אתחל את אפליקציית Messages ונסה שוב.

source: Please try again later.
he: אנא נסה שוב מאוחר יותר.
